Core/src/Documents/ПеремещениеВА/ПеремещениеВА.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПеремещениеВА</name>
  <registerRecords>InformationRegister.ПараметрыВнеоборотныхАктивов</registerRecords>
  <registerRecords>AccountingRegister.Хозрасчетный</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерТТН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>IDTТН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерСФ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>IDСФ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ВнеоборотныеАктивы</name>
    <attributes>
      <name>ВнеоборотныйАктив</name>
      <type>
        <types>CatalogRef.ВнеоборотныеАктивы</types>
      </type>
    </attributes>
    <attributes>
      <name>СтруктурнаяЕдиница</name>
      <type>
        <types>CatalogRef.СтруктурныеЕдиницы</types>
      </type>
    </attributes>
    <attributes>
      <name>СтруктурнаяЕдиницаПолучатель</name>
      <type>
        <types>CatalogRef.СтруктурныеЕдиницы</types>
      </type>
    </attributes>
    <attributes>
      <name>Адрес</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>АдресПолучатель</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбъемПродукцииРаботДляВычисленияАмортизации</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПервоначальнаяСтоимость</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НачислятьАмортизациюВТекущемМесяце</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СрокИспользованияДляВычисленияАмортизации</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СчетЗатрат</name>
      <type>
        <types>ChartOfAccountsRef.Управленческий</types>
      </type>
    </attributes>
    <attributes>
      <name>НаправлениеДеятельности</name>
      <type>
        <types>CatalogRef.НаправленияДеятельности</types>
      </type>
    </attributes>
    <attributes>
      <name>СчетЗатратРегл</name>
      <type>
        <types>ChartOfAccountsRef.Хозрасчетный</types>
      </type>
    </attributes>
    <attributes>
      <name>СтоимостьДляВычисленияАмортизации</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Core/src/InformationRegisters/ПараметрыВнеоборотныхАктивов/ПараметрыВнеоборотныхАктивов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПараметрыВнеоборотныхАктивов</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ОбъемПродукцииРаботДляВычисленияАмортизации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтоимостьДляВычисленияАмортизации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПрименитьВТекущемМесяце</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СчетЗатрат</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </resources>
  <resources>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </resources>
  <resources>
    <name>НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </resources>
  <resources>
    <name>СрокИспользованияДляВычисленияАмортизации</name>
    <comment>Срок использования</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СчетЗатратРегл</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>Адрес</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВнеоборотныйАктив</name>
    <type>
      <types>CatalogRef.ВнеоборотныеАктивы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Core/src/Enums/ТипыКонтактнойИнформации/ТипыКонтактнойИнформации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыКонтактнойИнформации</name>
  <enumValues>
    <name>Адрес</name>
  </enumValues>
  <enumValues>
    <name>Телефон</name>
  </enumValues>
  <enumValues>
    <name>АдресЭлектроннойПочты</name>
  </enumValues>
  <enumValues>
    <name>ВебСтраница</name>
  </enumValues>
  <enumValues>
    <name>Факс</name>
  </enumValues>
  <enumValues>
    <name>Другое</name>
  </enumValues>
  <enumValues>
    <name>Skype</name>
  </enumValues>
</mdclass:Enum>

Core/src/Documents/ПеремещениеВА/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Паганини_
	НайденныйЭлНакладная = УправлениеНебольшойФирмойСервер.ПолучитьПодчиненныйЭлНакладная(Объект.Ссылка);
	Элементы.ЭлектроннаяНакладнаяНадпись.Заголовок = РаботаСФормойДокументаКлиентСервер.СформироватьНадписьЭлНакладная(НайденныйЭлНакладная);
	Элементы.ЭлектроннаяНакладнаяНадпись.Доступность= РС_ИнтеграцияСНалоговойСлужбойГрузииПовтИсп.ПодсистемаДоступна_ИнтеграцияСНалоговойСлужбойГрузии();
	//_Паганини
	
	//+++ Дмгг
	ДатаДокумента = Объект.Дата;
	Если НЕ ЗначениеЗаполнено(ДатаДокумента) Тогда
		ДатаДокумента = ТекущаяДата();
		
		ИспользоватьТолькоРегламентированныйПланСчетов = ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ИспользованиеТолькоРегламентированногоПланаСчетов(ТекущаяДата()); //+++ Дмгг
	Иначе
		ИспользоватьТолькоРегламентированныйПланСчетов = ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ИспользованиеТолькоРегламентированногоПланаСчетов(ДатаДокумента);
	КонецЕсли;
	//--- Дмгг
	
КонецПроцедуры

&НаСервере
Процедура ВнеоборотныеАктивыВнеоборотныйАктивПриИзмененииНаСервере(УИДСтроки)
	
	ДатаЗапроса = Дата(1,1,1);
	Если ЗначениеЗаполнено(Объект.Дата) Тогда 
		Если Объект.Дата = НачалоДня(Объект.Дата) Тогда 
			ДатаЗапроса = ТекущаяДата();
		Иначе
			ДатаЗапроса = Объект.Дата-1;
		КонецЕсли;
	Иначе
		ДатаЗапроса = ТекущаяДата();
	КонецЕсли;
	
	СтрокаЗаполнения = Объект.ВнеоборотныеАктивы.НайтиПоИдентификатору(УИДСтроки);
	
	Если СтрокаЗаполнения = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПараметрыАмортизацииСрезПоследних.ВнеоборотныйАктив КАК ВнеоборотныйАктивТек,
	|	ПараметрыАмортизацииСрезПоследних.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ПараметрыАмортизацииСрезПоследних.СтруктурнаяЕдиница КАК СтруктурнаяЕдиницаПолучатель,
	|	ПараметрыАмортизацииСрезПоследних.ОбъемПродукцииРаботДляВычисленияАмортизации КАК ОбъемПродукцииРаботДляВычисленияАмортизации,
	|	ПараметрыАмортизацииСрезПоследних.СтоимостьДляВычисленияАмортизации КАК СтоимостьДляВычисленияАмортизации,
	|	ПараметрыАмортизацииСрезПоследних.СрокИспользованияДляВычисленияАмортизации КАК СрокИспользованияДляВычисленияАмортизации,
	|	ПараметрыАмортизацииСрезПоследних.СчетЗатрат КАК СчетЗатрат,
	|	ПараметрыАмортизацииСрезПоследних.СчетЗатратРегл КАК СчетЗатратРегл,
	|	ПараметрыАмортизацииСрезПоследних.Адрес КАК Адрес,
	|	ПараметрыАмортизацииСрезПоследних.НаправлениеДеятельности КАК НаправлениеДеятельности
	|ИЗ
	|	РегистрСведений.ПараметрыВнеоборотныхАктивов.СрезПоследних(
	|			&ДатаДокумента,
	|			Организация = &Организация
	|				И ВнеоборотныйАктив = &ВнеоборотныйАктив) КАК ПараметрыАмортизацииСрезПоследних";
	
	Запрос.УстановитьПараметр("ДатаДокумента", ДатаЗапроса);
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("ВнеоборотныйАктив", СтрокаЗаполнения.ВнеоборотныйАктив);
	
	ВыборкаРезультат = Запрос.Выполнить().Выбрать();
	
	Пока ВыборкаРезультат.Следующий() Цикл 
		ЗаполнитьЗначенияСвойств(СтрокаЗаполнения ,ВыборкаРезультат);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ВнеоборотныеАктивыВнеоборотныйАктивПриИзменении(Элемент)
	
	ТекСтрока = Элементы.ВнеоборотныеАктивы.ТекущиеДанные;
	
	УИДСтроки = ТекСтрока.ПолучитьИдентификатор();
	
	ВнеоборотныеАктивыВнеоборотныйАктивПриИзмененииНаСервере(УИДСтроки);
	
КонецПроцедуры

&НаКлиенте
Процедура КомментарийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(Элемент.ТекстРедактирования, ЭтотОбъект, "Объект.Комментарий");
	
КонецПроцедуры


//Паганини_
&НаКлиенте
Процедура ЭлектроннаяНакладнаяНадписьОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ОчиститьСообщения();
	
	Если НЕ ПроверитьВозможностьСозданияЭЛНакладной() Тогда 
		Возврат;	
	КонецЕсли;
	
	
	ПараметрыФормы   = Новый Структура;
	массивДокументов = Новый Массив;
	массивДокументов.Добавить(Объект.Ссылка);
	ПараметрыФормы.Вставить("ДокументыОснования", массивДокументов);
	
	УправлениеНебольшойФирмойКлиент.ОткрытьЭлНакладную(ЭтотОбъект,ПараметрыФормы);
	
	СтатистикаИспользованияФормКлиент.ПриИнтерактивномДействии(ЭтотОбъект, Элемент, "ОбработкаНавигационнойСсылки");
КонецПроцедуры
&НаКлиенте
Функция ПроверитьВозможностьСозданияЭЛНакладной()
	
	Результат = Истина;
	Если Модифицированность Или НЕ ПроверитьЗаполнение() Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = НСтр("ka='დოკუმენტი შეიცვალა. თავდაპირველად, საჭიროა დოკუმენტის ჩაწერა!';ru='Документ был изменен. Сначала следует записать документ!';en='The document has been changed. First, you must write the document!'");	
		Сообщение.Сообщить();
		Результат = Ложь;
	Иначе
		Результат = Истина;
	КонецЕсли;

	Возврат Результат;
	
КонецФункции


&НаСервере
Процедура ВнеоборотныеАктивыСтруктурнаяЕдиницаПолучательПриИзмененииНаСервере(УИД_Строки)
	
	ТекСтрока = Объект.ВнеоборотныеАктивы.НайтиПоИдентификатору(УИД_Строки);
	
	МассивАдресовСтруктурнойЕдиницы = ТекСтрока.СтруктурнаяЕдиницаПолучатель.КонтактнаяИнформация.НайтиСтроки(Новый Структура("Тип, Вид", Перечисления.ТипыКонтактнойИнформации.Адрес, Справочники.ВидыКонтактнойИнформации.ФактАдресСтруктурнойЕдиницы));
	
	Если МассивАдресовСтруктурнойЕдиницы.Количество() <> 0 Тогда 
		ТекСтрока.АдресПолучатель = МассивАдресовСтруктурнойЕдиницы[0].Представление;
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ВнеоборотныеАктивыСтруктурнаяЕдиницаПолучательПриИзменении(Элемент)
	ТекСтрока= Элементы.ВнеоборотныеАктивы.ТекущиеДанные;
	УИД_Строки = ТекСтрока.ПолучитьИдентификатор();
	ВнеоборотныеАктивыСтруктурнаяЕдиницаПолучательПриИзмененииНаСервере(УИД_Строки);
КонецПроцедуры


&НаКлиенте
Процедура ДатаПриИзменении(Элемент) //+++ Дмгг
	
	ИспользоватьТолькоРегламентированныйПланСчетов = ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ИспользованиеТолькоРегламентированногоПланаСчетов(Объект.Дата); //+++ Дмгг
	
КонецПроцедуры
//_Паганини

//+++ Дмгг
&НаКлиенте
Функция ПолучитьДанныеВыбораПоАдресу(Элемент, Адрес, СтандартнаяОбработка)

    // Выключим стандартную обработку
    СтандартнаяОбработка    =    Ложь;
    
    // Определим структуру для получения параметров отбора, 
    // так как стандартный выбор мы выключим значения структуры пусты                                                            
    ПараметрыПодбора    =    Новый Структура("Отбор,СтрокаПоиска,ВыборГруппИЭлементов",
                                Новый Структура(), // Здесь можно установить отбор
                                "",                // Передаем введенный в поле текст
                                ПредопределенноеЗначение("ИспользованиеГруппИЭлементов.Элементы"));
                                
    // Дополним стандартную структуру с дополнительными параметрами для поиска по адресу
    ПараметрыПодбора.Вставить("ДополнительныеПараметры", Новый Структура("Адрес", Адрес));
    
    
    // Передаем адрес и получаем список выбора
    Возврат    ПолучитьДанныеВыбора(Тип("СправочникСсылка.Адреса"), ПараметрыПодбора);

КонецФункции

&НаКлиенте
Процедура ВнеоборотныеАктивыАдрессПолучательНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекСтрока = Элементы.ВнеоборотныеАктивы.ТекущиеДанные;
	
	П = Новый Структура;
    П.Вставить("Ключ", ТекСтрока.АдресПолучатель);

   ОткрытьФорму("Справочник.Адреса.ФормаВыбора", П, ЭтаФорма,,,,Новый ОписаниеОповещения("РедактироватьАдресаЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
Процедура РедактироватьАдресаЗавершение(Результат, ДополнительныеПараметры) Экспорт
    
    ТекСтрока = Элементы.ВнеоборотныеАктивы.ТекущиеДанные;
	Если ЗначениеЗаполнено(Результат) Тогда 
		ТекСтрока.АдресПолучатель = Результат;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВнеоборотныеАктивыАдрессПолучательОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ТекСтрока = Элементы.ВнеоборотныеАктивы.ТекущиеДанные;
	
	ТекСтрока.АдресПолучатель    =    ВыбранноеЗначение;
	
КонецПроцедуры

&НаКлиенте
Процедура ВнеоборотныеАктивыАдрессПолучательАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	ТекСтрока = Элементы.ВнеоборотныеАктивы.ТекущиеДанные;

    знТекст    =    ?(ПустаяСтрока(Текст), ТекСтрока.АдресПолучатель, Текст);
    ДанныеВыбора    =    ПолучитьДанныеВыбораПоАдресу(Элемент, знТекст, СтандартнаяОбработка);
	
КонецПроцедуры
//--- Дмгг
